// Операція передачі адреси у функцію здійснюється за допомогою вказівників.
// Вказівники дозволяють працювати з пам'яттю безпосередньо за допомогою її
// адреси. При передачі адреси змінної у функцію, функція отримує доступ до
// значення цієї змінної та може вносити зміни безпосередньо у відповідну
// область пам'яті.

// Операція передачі адреси здійснюється шляхом використання вказівникової
// змінної у функції та передачі адреси змінної як аргументу. Оголошення
// вказівника відбувається за допомогою символу *. Наприклад, якщо ми хочемо
// передати адресу змінної x у функцію, ми оголошуємо вказівник int *ptr, а при
// виклику функції передаємо адресу змінної &x. Усередині функції ми можемо
// отримати доступ до значення x через вказівник ptr та вносити зміни до цього
// значення.

#include <stdio.h>

void modifyValue(int *ptr) {
  *ptr = 100; // Вносимо зміни у значення, доступаючись до нього через вказівник
}

int main() {
  int x = 5;
  printf("Значення до змін: %d\n", x);

  modifyValue(&x); // Передаємо адресу змінної x у функцію
  printf("Значення після змін: %d\n", x);

  return 0;
}

// В цьому прикладі функція modifyValue() приймає вказівник ptr як параметр та
// вносить зміни до значення, до якого вказівник вказує, за допомогою оператора
// *. При передачі адреси змінної x у функцію за допомогою &x, функція отримує
// доступ до x через вказівник та встановлює його значення на 100. Після виклику
// функції значення x змінюється, і ми виводимо оновлене значення у функції
// main().